safabulat/stm32g0/Project3/main.c
/*
 * name: main.c
 *
 * author: Mahmut Safa BULAT
 *
 * description: This is a project3 main file for ELEC334 project3;
 * "Voice Recorder"
 * Every section is properly explained with comments.
 * You can find pin connections at the end of the code (down below the main)
 */

//********************************Includes*******************************//
#include "stm32g0xx.h"
#include "stm32g0_i2c-lcd.h"
#include "stdio.h"
//**************************Includes * END*******************************//
//*****************************Definitions*******************************//
#define eeprom_1_address	0x50
#define eeprom_2_address	0x54
#define lcd_address			0x27

#define eeprom_end 0xFFFF
#define eeprom_half 0x7FFF

#define secdelay 1000000

//********************************Definitions * END******************************//

//********************************Global Variables*******************************//
int state,full,idle =0;		//state flags
int track_select=0;				//track select
int recorded[4]={0,0,0,0};
int isEEPfull;
int i2c_rec_play=0;

int pressedKey;
int count =0;
int clock_counter=0;
int second,mecond;
int play, record=0;

uint8_t recBoard[10],q;
uint8_t a[10];
uint8_t inputCaptureVal=0x0;

uint8_t pwmvalue_save;
uint8_t pwmvalue_load;
uint8_t track[1];
uint32_t pwmfreq=160;

//uint8_t track[10];
const uint16_t regAddr1=0x0;			//1st track address start
const uint16_t regAddr2=0x8000;		//2nd track address start

uint16_t regAddr1_tracker=0x0;
uint16_t regAddr2_tracker=0x8000;

uint16_t trackEndTRY;
//******************************Global Variables * END*************************//

//**********************************Functions**********************************//
void sysclock_64M(){

	RCC->CR |= (1U << 8);			//Enable HSI16
	while( (RCC->CR & (1U << 10)));	//wait for cyrstal

	FLASH->ACR |= (1U << 8);		//CPU Prefetch enable
	FLASH->ACR &= ~(0x7U << 0);		//Flash memory access latency; reset
	FLASH->ACR |= (1U << 0);		//Flash memory access latency; set to 1 wait state

	RCC->PLLCFGR |= (2U << 0);		//Select HSI16 for pll source
	RCC->PLLCFGR &= ~(0x7U << 4);	//PLLM division /1
	RCC->PLLCFGR |= (0x8U << 8);	//PLL frequency multiplication factor N x8
	RCC->PLLCFGR &= ~(0x7U << 29);	//PLL VCO division factor R for PLLRCLK clock output; reset
	RCC->PLLCFGR |= (1U << 29);		//PLL VCO division factor R for PLLRCLK clock output; /2
	RCC->PLLCFGR |= (1U << 28);		//PLLRCLK clock output enable

	RCC->CFGR &= ~(1U << 11);		//AHB prescaler to /1
	RCC->CFGR &= ~(1U << 14);		//APB prescaler to /1

	RCC->CR |= (1U << 24);			//PLLON: PLL enable
	while( (RCC->CR & (1U << 25)));//Wait for PLL to stable

	RCC->CFGR &= ~(0x7U << 0);		//System clock switch to PLLRCLK
	RCC->CFGR |= (2U << 0);			//System clock switch to PLLRCLK
	while( (RCC->CFGR & (2U << 3)));//Wait for PLL to stable

	SystemCoreClockUpdate();

	SysTick_Config(SystemCoreClock);
}
void delay(volatile uint32_t s) {	//delay function
    for(; s>0; s--);
    /* @Name:	delay
	 *
	 * @Brief:	this function causes desired amount of delay.
	 */
}
void init_timer1(){											//initialization of the TIM1
	RCC->APBENR2 |= (1U << 11); //enable clock for timer1

	TIM1->CR1	 = 0;
	TIM1->CR1	|= (1<<7);		//enable auto reload
	TIM1->CR1	|= (0<<4);		//direction = up-counter

	TIM1->CNT	 = 0;			//Set default TIM1 values
	TIM1->ARR	 = 2000;		//for 1 second interval
	TIM1->PSC	 = 1600;		//With AutoReloadRegister and PreSCaler.

	TIM1->DIER	|= (1<<0);		//enable update interrupt
	TIM1->CR1	|= (1<<0);		//enable TIM1

	NVIC_SetPriority(TIM1_BRK_UP_TRG_COM_IRQn,2);	//Set priority to 2
	NVIC_EnableIRQ(TIM1_BRK_UP_TRG_COM_IRQn);		//Enable NVIC for TIM1

	/* @Name:	init_timer1
	 *
	 * @Brief:	this function configures and enables timer1 with priority of 2.
	 */
}
void init_timer2(){											//initialization of the TIM2 for PWM
	RCC->APBENR1 |= (1U << 0); 		//enable clock for timer2
	RCC->IOPENR  |= (1U << 1);		//enable GPIOB for PWM out at PB3


	TIM2->CR1	 = 0;				//reset control register1
	TIM2->CCMR1	 = 0;				//reset capture/compare register

	TIM2->CR1	|= (1U<<4);			//direction = down-counter

	TIM2->CNT	 = 0;				//Set default TIM2 values
	TIM2->ARR	 = 255;				//for 8-bit setup = 250kHz
	TIM2->PSC	 = 0;			//With AutoReloadRegister and PreSCaler.
	TIM2->CCR2	 = pwmfreq/2;		//for %50 duty cycle
	//PWM configuration for TIM2_CH2
	TIM2->CCMR1 &= ~(0x7U << 12);			//reset oc2m
    TIM2->CCMR1 |= (0x6U << 12);			//oc2m; pwm mode 1 for channel2

    TIM2->CR1	|= (1U<<7);					//enable auto reload
    TIM2->EGR 	|= (1<<0);      			//update generation

    TIM2->CCMR1 |= (1U << 11);				//enable output compare2 preload
    TIM2->CCER 	|= (1U << 4);        		//enable capture/compare2 output

    GPIOB->MODER &= ~(3U << 2*3);      		//pb3
    GPIOB->MODER |= (2U << 2*3);        	//alternate mode
//    GPIOB->OSPEEDR |= (3U << 2*3);        	//high precision on change
    GPIOB->AFR[0] &= ~(0xFU << 4*3);   		//af4 for = TIM2_CH2
    GPIOB->AFR[0] |= (2U << 4*3);        	// AFSEL5 -> AF2 [0010]

//	TIM2->TISEL &= ~(0xFU << 8);

	TIM2->DIER	|= (1<<0);		//enable update interrupt
	TIM2->CR1	|= (1<<0);		//enable TIM2

	NVIC_SetPriority(TIM2_IRQn,2);	//Set priority to 2
	NVIC_EnableIRQ(TIM2_IRQn);		//Enable NVIC for TIM1
	/* @Name:	init_timer2
	 *
	 * @Brief:	this function configures and enables timer.
	 */
}
void init_timer3(){											//initialization of the TIM3 for ADC
	RCC->APBENR1 |= (1U << 1); //enable clock for timer3

	TIM3->CR1	 = 0;
	TIM3->CR1	|= (1<<7);		//enable auto reload
	TIM3->CR1	|= (1<<4);		//direction = down-counter

	TIM3->CNT	 = 0;		//Set default TIM3 values
	TIM3->ARR	 = 125;		//for 25600 Hz
	TIM3->PSC	 = 5;		//With AutoReloadRegister and PreSCaler.

	TIM3->CR2 |= (2U << 4);		//MMS; Update

	TIM3->CR1	|= (1<<0);		//enable TIM3
	/* @Name:	init_timer3
	 *
	 * @Brief:	this function configures and enables timer.
	 */
}
void init_timer16(){											//initialization of the TIM3 for ADC
	RCC->APBENR2 |= (1U << 17); //enable clock for timer16

	TIM16->CR1	 = 0;
	TIM16->CR1	|= (1<<7);		//enable auto reload

