safabulat/stm32g0/Project3/main.c
	TIM16->CNT	 = 0;		//Set default TIM3 values
	TIM16->ARR	 = 1000;		//for 25600 Hz
	TIM16->PSC	 = 1;		//With AutoReloadRegister and PreSCaler.

	TIM16->DIER	|= (1<<0);		//enable update interrupt
	TIM16->CR1	|= (1<<0);		//enable TIM3

	NVIC_SetPriority(TIM16_IRQn,2);	//Set priority to 2
	NVIC_EnableIRQ(TIM16_IRQn);		//Enable NVIC for TIM1
	/* @Name:	init_timer3
	 *
	 * @Brief:	this function configures and enables timer.
	 */
}
void init_i2c(){											//initialization of the I2C1

	//Enable GPIOB
	RCC->IOPENR |= (1U << 1);

	//Setup PB6 as AF6
	GPIOB->MODER &= ~(3U << 2*6);
	GPIOB->MODER |= (2 << 2*6);
	GPIOB->OTYPER |= (1U << 6);
	GPIOB->PUPDR |= (1<< 2*6);  //Pull up for PB6
	//Chose AF6 from mux
	GPIOB->AFR[0] &= ~(0xFU << 4*6);
	GPIOB->AFR[0] |= (6 << 4*6);
	//Setup PB7 as AF6
	GPIOB->MODER &= ~(3U << 2*7);
	GPIOB->MODER |= (2U << 2*7);
	GPIOB->OTYPER |= (1U << 7);
	GPIOB->PUPDR |= (1<< 2*7);  //Pull up for PB7
	//Chose AF6 from mux
	GPIOB->AFR[0] &= ~(0xFU << 4*7);
	GPIOB->AFR[0] |= (6 << 4*7);
	//Enable i2c1
	RCC->APBENR1 |= (1U << 21);

	I2C1->CR1 =0;
	I2C1->CR1 |= (1U << 7); //ERRI

	I2C1->TIMINGR |= (3 << 28);		//PRESCALAR
	I2C1->TIMINGR |= (0x13 << 0);	//SCLL
	I2C1->TIMINGR |= (0xF << 8);	//SCLH
	I2C1->TIMINGR |= (0x2 << 16);	//SDADEL
	I2C1->TIMINGR |= (0x4) << 20;	//SCLDEL

	I2C1->CR1 |= (1U << 0);			//PE

	NVIC_SetPriority(I2C1_IRQn,2);	//Set priority to 2
	NVIC_EnableIRQ(I2C1_IRQn);		//Enable NVIC for TIM1

	/* @Name:	init_i2c
		 *
		 * @Brief:	this function configures and enables i2c bus for
		 * PB6 (for SCL) and PB7 (for SDA) pins with priority of 2.
		 */
}
void init_adc(){

	RCC->APBENR2 |= (1U << 20); 	//enable rcc for adc
	RCC->IOPENR |= (1U << 1);		//enable GPIOB
	//PB1 pin for adc in analog mode (by default)

	ADC1->CR	 = 0;				//reset adc cr
	ADC1->CFGR1  = 0;				//reset adc cfgr1

	ADC1->CR |= (1U << 28);			//Enable adc voltage regulator
	delay(500);						//delay >20 uS

	//enable calibration, wait until completion
	ADC1->CR |= (1U << 31);			//calibration enable
	while(!(ADC1->ISR & (1 << 11)));//Wait until EOCAL=1.

	//enable end of cal. or sequence interrupts
	ADC1->IER |= (1U << 2); //end of conversion sequence interrupt
//	ADC1->IER |= (1U << 11); //end of calibration interrupt

	//select resolution [conf. bit sample (6,8,10,12)]
	ADC1->CFGR1 |= (2U << 3);// ; 8bit

	//conf. single/continuous;
	ADC1->CFGR1 &= ~(1U << 13);//cont=0;
	ADC1->CFGR1 &= ~(1U << 16);//discen =0; single

	//select sampling time from SMPR
	ADC1->SMPR |= (0 << 0);//SMP1
	ADC1->SMPR |= (1U << 4);//SMP2

	//select tim3 trgo
	ADC1->CFGR1 |= (3U << 6); //TGRO (extsel); 0xb011=3U for TIM3_TRGO
	ADC1->CFGR1 |= (1U << 10); //Choose detect at rising edge (exten); 01

	//enable channels (for the ANx pins)
	ADC1->CFGR1 |= (9U << 26);//analog input channel 9; PB1
	ADC1->CHSELR |= (1U << 9);//analog input channel 9; PB1

	//Clear the ADRDY bit in ADC_ISR register by programming this bit to 1.
	ADC1->ISR |= (1U << 0);

	//enable adc and wait until it is ready
	ADC1->CR |= (1U << 0);
	while(!(ADC1->ISR & (1U << 0)));

	NVIC_SetPriority(ADC1_IRQn,2);	//Set priority to 2
	NVIC_EnableIRQ(ADC1_IRQn);		//Enable NVIC for TIM1

	//Start conversion
	ADC1->CR |= (1U << 2);
}
void write_I2C(uint8_t devAddr,uint8_t* data, int Size){	//write function for i2c1 (no address)
	//Send address and register to read
	I2C1->CR2 =0;									//clear register
	I2C1->CR2 |= (uint32_t)(devAddr << 1);			//Send slave address
	I2C1->CR2 |= (uint32_t)(Size << 16); 			//Number of bytes
	I2C1->CR2 |= (1U << 25); 						//AUTOEND
	I2C1->CR2 |= (1U << 13); 						//Generate start

	while(Size){									//while size loop
		while( !(I2C1->ISR & (1 << 1)));			//is flag busy?
		I2C1->TXDR = (*data++);						//sen data, data++
		Size--;										//size = size-1;
	}
}
void read_I2C(uint8_t devAddr,uint8_t* data,int Size){		//read function for i2c1 (no address)
	//read Data
	I2C1->CR2 =0;
	I2C1->CR2 |= (uint32_t)(devAddr << 1);
	I2C1->CR2 |= (1U << 10); 						//Read mode
	I2C1->CR2 |= (uint32_t)(Size << 16); 			//Number of bytes
	I2C1->CR2 |= (1U << 25); 						//AUTOEND
	I2C1->CR2 |= (1U << 13); 						//Generate start

	while(Size){
		while( !(I2C1->ISR & (1 << 2)));
		(*data++) = (uint8_t)I2C1->RXDR;
		Size--;
	}
}
void write_memory_I2C(uint8_t devAddr,uint16_t memAddr,uint8_t* data, int Size){
	//Send address and register to read
	I2C1->CR2 =0;
	I2C1->CR2 |= (uint32_t)(devAddr << 1);
	I2C1->CR2 |= (uint32_t)(( Size + 2)<< 16); 		//Number of bytes
	I2C1->CR2 |= (1U << 25); 						//AUTOEND
	I2C1->CR2 |= (1U << 13); 						//Generate start

	while(!(I2C1->ISR & (1 << 1)));					//high address
	I2C1->TXDR = (uint32_t)(memAddr >> 8);			//(uint32_t)

	while(!(I2C1->ISR & (1 << 1)));					//low address
	I2C1->TXDR = (uint32_t)(memAddr & 0xFF);		//(uint32_t)

	while(Size){									//while size loop
		while( !(I2C1->ISR & (1 << 1)));			//is flag busy?
		I2C1->TXDR = (*data++);						//sen data, data++
		Size--;										//size = size-1;
	}
}
void random_read_I2C(uint8_t devAddr,uint16_t memAddr,uint8_t* data,int Size){
	//Send address and register to read
	I2C1->CR2 =0;
	I2C1->CR2 |= (uint32_t)(devAddr << 1);
	I2C1->CR2 |= (2U << 16); 						//Number of bytes
	I2C1->CR2 |= (1U << 13); 						//Generate start

	while(!(I2C1->ISR & (1 << 1)));
	I2C1->TXDR = (uint32_t)(memAddr >> 8);			//(uint32_t)

	while(!(I2C1->ISR & (1 << 1)));
	I2C1->TXDR = (uint32_t)(memAddr & 0xFF);		//(uint32_t)

	while(!(I2C1->ISR & (1 << 6)));					//transmission complete

	//read Data
	I2C1->CR2 =0;
	I2C1->CR2 |= (uint32_t)(devAddr << 1);
	I2C1->CR2 |= (1U << 10); 						//Read mode
	I2C1->CR2 |= (uint32_t)(Size << 16); 			//Number of bytes
	I2C1->CR2 |= (1U << 25); 						//AUTOEND
	I2C1->CR2 |= (1U << 13); 						//Generate start


	while(Size){
		while( !(I2C1->ISR & (1 << 2)));
		(*data++) = (uint8_t)I2C1->RXDR;
		Size--;
	}
}
void init_keypad(){					//initialization of the Keypad

	/*Keypad Configuration
	* inputs:	pins; PORTA_12/11/6/7	roles; COL_1/2/3/4
	* outputs:	pins; PORTA_5/4/1/0		roles; ROW_1/2/3/4
	*/

