safabulat/stm32g0/Project3/main.c
    //PORTA
    GPIOA->MODER &= ~(0x3C0FF0FU);	//allocate pins 0 to 12
    //outputs
    GPIOA->MODER |= (1U << 2*5);	//row1
    GPIOA->MODER |= (1U << 2*4);	//row2
    GPIOA->MODER |= (1U << 2*1);	//row3
    GPIOA->MODER |= (1U << 2*0);	//row4
    //inputs
/*	since we allocate pins above, that sends 00' to the
 *	related bit field. 00' also means input mode so we
 *	don't have to do GPIOA->MODER |= (0U << 2*12);	//col1
 *	for inputs. OR operation with 0 is useless anyway.
 *
 *	::: So that means our inputs are ready.
 */

	/* @Name:	init_keypad
	 *
	 * @Brief:	this function activates the pins and set them as outputs or inputs for the keypad module.
	 */

}
uint8_t keypad(){					//keypad button configurations

	//Set 1 row active(logic 0) and rest deactive(logic 1)
	//and check inputs; if there is button pressed (logic 0)
	//and return a value if pressed.

	//***********************************************ROW 1******************************//
	GPIOA->ODR &= (0U << 5);	//	row1
	GPIOA->ODR |= (1U << 4);	//	row2
	GPIOA->ODR |= (1U << 1);	//	row3
	GPIOA->ODR |= (1U << 0);	//	row4

	delay(10);
	if((~(GPIOA->IDR)) & (1U << 12)){
		return '1';
	}
	if((~(GPIOA->IDR)) & (1U << 11)){
		return '2';
	}
	if((~(GPIOA->IDR)) & (1U << 6)){
		return '3';
	}
	if((~(GPIOA->IDR)) & (1U << 7)){
		return 'A';
	}
	//***********************************************ROW 2******************************//
	GPIOA->ODR &= (0U << 4);	//	row2
	GPIOA->ODR |= (1U << 5);	//	row1
	GPIOA->ODR |= (1U << 1);	//	row3
	GPIOA->ODR |= (1U << 0);	//	row4

	delay(10);
	if((~(GPIOA->IDR)) & (1U << 12)){
		return '4';
	}
	if((~(GPIOA->IDR)) & (1U << 11)){
		return '5';
	}
	if((~(GPIOA->IDR)) & (1U << 6)){
		return '6';
	}
	if((~(GPIOA->IDR)) & (1U << 7)){
		return 'B';
	}
	//***********************************************ROW 3******************************//
	GPIOA->ODR &= (0U << 1);	//	row3
	GPIOA->ODR |= (1U << 5);	//	row1
	GPIOA->ODR |= (1U << 4);	//	row2
	GPIOA->ODR |= (1U << 0);	//	row4

	delay(10);
	if((~(GPIOA->IDR)) & (1U << 12)){
		return '7';
	}
	if((~(GPIOA->IDR)) & (1U << 11)){
		return '8';
	}
	if((~(GPIOA->IDR)) & (1U << 6)){
		return '9';
	}
	if((~(GPIOA->IDR)) & (1U << 7)){
		return 'C';
	}
	//***********************************************ROW 4******************************//
	GPIOA->ODR &= (0U << 0);	//	row4
	GPIOA->ODR |= (1U << 5);	//	row1
	GPIOA->ODR |= (1U << 4);	//	row2
	GPIOA->ODR |= (1U << 1);	//	row3


	delay(10);
	if((~(GPIOA->IDR)) & (1U << 12)){
		return 'E';
	}
	if((~(GPIOA->IDR)) & (1U << 11)){
		return '0';
	}
	if((~(GPIOA->IDR)) & (1U << 6)){
		return 'F';
	}
	if((~(GPIOA->IDR)) & (1U << 7)){
		return 'D';
	}
	//***********************************************ELSE******************************//
	else
		return 'Q'; //return if no button pressed.


		/* @Name:	keypad
		 *
		 * @Brief:	this function gets a value when we press the button on keypad,
		 * and returnes that value to itself. And we can catch the key press like;
		 * 		a = keypad()  => a' captures the key value...
		 */
}
void capture_key(int keycapture){	//capture (switched) key

	if(keycapture == 'Q'){								//default

	}
	else if(keycapture == '1'){								//track_select = 1
		track_select =1;
		second=0;
		clock_counter=0;
	}
	else if(keycapture == '2'){								//track_select = 2
		track_select =2;
		second=0;
		clock_counter=0;
	}
	else if(keycapture == '3'){								//track_select = 3
		track_select =3;
		second=0;
		clock_counter=0;
	}
	else if(keycapture == 'A'){								//track_select = 4
		track_select =4;
		second=0;
		clock_counter=0;
	}


	else if(keycapture == 'D'){								//Reset Key
		//Reset the timeout value if  key pressed
		second=0;
		clock_counter=0;
		play=0;
		record=0;
		regAddr1_tracker=0x0;
		regAddr2_tracker=0x8000;
		i2c_rec_play=0;
	}
	else if(keycapture == '9'){							// -menu key
		//Reset the timeout value if  key pressed
		second=0;
		clock_counter=0;
		state--;
		idle=0;
	}
	else if(keycapture == 'C'){							// +menu key
		//Reset the timeout value if  key pressed
		second=0;
		clock_counter=0;
		state++;
		idle=0;
	}
	else if(keycapture == 'E'){							//Record Key
		//Reset the timeout value if  key pressed
		second=0;
		clock_counter=0;
		record=1;
		play=0;
		i2c_rec_play=1;
	}
	else if(keycapture == '0'){							//Playback Key
		//Reset the timeout value if  key pressed
		second=0;
		clock_counter=0;
		play=1;
		record=0;
		i2c_rec_play=2;
	}
	else if(keycapture == 'F'){							//idle Key
		//Reset the timeout value if  key pressed
		second=0;
		clock_counter=0;
		i2c_rec_play=0;
		idle=1;
	}
	/* @Name:	capture_key
	 * @Brief:	The mechanism abowe is basicly makes the shitfing (the digits) .
	 * There is no point of commenting every line, it does for example;
	 * 					for	digit1=3 and digit0=2 if i press 3
	 * 					digits become; d0 = 3, d1=2, d2=3
	 */
}
void idle_state(){

	lcd_setCursor(1,1);
	lcd_send_string("   IDLE State   ");
	lcd_setCursor(2,1);
	lcd_send_string("Waiting Menu Key");
	//show IdLE and wait for menu select key

	 /* @Name:	idle_state
	 *
	 * @Brief:	this function is stand-by phase of the calculator.
	 * It shows desired 4 digit on the SSD at start. You can activate calculator by pressing F button.
	 * The calculator will return to this stage if no button is pressed for 10 seconds.
	 */
}
void status_state(){
	lcd_setCursor(1,1);
	lcd_send_string("  STATUS State  ");
	lcd_setCursor(2,1);
	lcd_PrintInt(isEEPfull);
	lcd_setCursor(2,2);
	lcd_send_string(" ");
	lcd_setCursor(2,3);
	lcd_send_string("Rec Avaliable.");

	//show rcd and wait for track select or status

	 /* @Name:	status_state
	 *
	 * @Brief:	this function is stand-by phase of the calculator.
	 * It shows desired 4 digit on the SSD at start. You can activate calculator by pressing F button.
	 * The calculator will return to this stage if no button is pressed for 10 seconds.
	 */
}
void full_state(){
	lcd_setCursor(1,1);
	lcd_send_string("   FULL State   ");
	lcd_setCursor(2,1);
	lcd_send_string("EEPROMs are FULL");
	delay(3000000);
	full=0;
	 /* @Name:	full_state
	 *
	 * @Brief:	this function is stand-by phase of the calculator.
	 * It shows desired 4 digit on the SSD at start. You can activate calculator by pressing F button.
	 * The calculator will return to this stage if no button is pressed for 10 seconds.
	 */
}
void record_state(){
	lcd_setCursor(1,1);
	lcd_send_string("  RECORD State  ");
	lcd_setCursor(2,1);
	lcd_send_string("Track?: ");
	lcd_setCursor(2,9);
	lcd_PrintInt(track_select);
	lcd_setCursor(2,10);
	lcd_send_string("       ");



	 /* @Name:	record_state
	 *
	 * @Brief:	this function is stand-by phase of the calculator.
	 * It shows desired 4 digit on the SSD at start. You can activate calculator by pressing F button.
	 * The calculator will return to this stage if no button is pressed for 10 seconds.
	 */
}
void playback_state(){
	lcd_setCursor(1,1);
	lcd_send_string(" PLAYBACK State ");
	lcd_setCursor(2,1);
	lcd_send_string("Track?: ");
	lcd_setCursor(2,9);
	lcd_PrintInt(track_select);
	lcd_setCursor(2,10);
	lcd_send_string("       ");


	 /* @Name:	playback_state
	 *
	 * @Brief:	this function is stand-by phase of the calculator.
	 * It shows desired 4 digit on the SSD at start. You can activate calculator by pressing F button.
	 * The calculator will return to this stage if no button is pressed for 10 seconds.
	 */
}
void voice_recorder(){					//Voice recorder main function

	//*******************IF RECORDED*************************//
	if((isEEPfull==4) && (full == 1)){						//full_state
		full_state();
	}
	else{
	//*******************IF STATE***************************//
		if(idle == 1){						//idle_state
			idle_state();
		}
		else if(state == 1){				//record_state
			record_state();
		}
		else if(state == 2){				//playback_state
			playback_state();
		}
		else if(state == 3){				//status_state
			status_state();
		}
		else if(state > 3){					//reset/clear etc. state
			state=1;
		}
		else if(state < 1){					//reset/clear etc. state
			state=3;
		}
	}
	 /* @Name:	voice_recorder
	 *
	 * @Brief:	this function is voice_recorder. It operates as followings;
	 *
	 */
}
//*******************************Functions * END*******************************//

//*****************************Interrupts and main****************************//
void TIM1_BRK_UP_TRG_COM_IRQHandler(void){		//timer1 interrupt handler
	pressedKey= keypad();						//get pressed key
	capture_key(pressedKey);					//send pressed key
	clock_counter++;
    isEEPfull=recorded[0]+recorded[1]+recorded[2]+recorded[3];

	if((record == 1) || (play == 1)){			//dont go to idle or etc
		clock_counter=0;						//when its recording or
		second=0;								//when its playing
	}
	if(clock_counter == 5){						//for 1sec timeout
		clock_counter=0;
		second++;
		GPIOC->ODR ^= (1U << 6);				//blink test led (PC6 onboard led)

		if(second==10){							//if 10sec has passed;
			second=0;							//reset second counter
			idle=1;								//go to the idle state
		}
	}
	TIM1->SR	&= ~(1U <<0); 					//clear update status
}
void TIM2_IRQHandler(void){						//timer2 interrupt handler
	TIM2->CCR2=(uint32_t)(pwmvalue_load-180)/2;	//send value buffer to pwm (to speaker)
	TIM2->SR	&= ~(1U <<0); 					//clear update status
}
void TIM3_IRQHandler(void){						//timer3 interrupt handler
	TIM3->SR	&= ~(1U <<0); 			//clear update status
	//closed
}
void TIM16_IRQHandler(void){

