safabulat/stm32g0/Project3/main.c
	if(i2c_rec_play==1){
		if(track_select == 1){
	    	if(record == 1){
	    		play=0;
	    		write_memory_I2C(eeprom_1_address, (uint16_t)regAddr1_tracker, (uint8_t *)&pwmvalue_save, 1);
	    		delay(10000);
	    		regAddr1_tracker++;

	    		if((regAddr1_tracker >= 0x7FFF)  || (record==0)){
	    			record=0;
	    			regAddr1_tracker=0x0;
	    			recorded[0]=1;

	    			i2c_rec_play=0;
	    		}

	    	}
		}
		else if(track_select == 2){
	    	if(record == 1){
	    		play=0;
	//    		write_memory_I2C(eeprom_1_address, (uint16_t)regAddr2_tracker, (uint8_t *)&pwmvalue_save, 1);

	    		regAddr2_tracker++;

	    		if((regAddr2_tracker >= 0xFFFF)  || (record==0)){
	    			record=0;
	    			regAddr2_tracker=0x8000;
	    			recorded[1]=1;

	    			i2c_rec_play=0;
	    		}
	    	}

		}
		else if(track_select == 3){
			if(record == 1){
				play=0;
	//		    write_memory_I2C(eeprom_2_address, (uint16_t)regAddr1_tracker, (uint8_t *)&pwmvalue_save, 1);
				regAddr1_tracker++;

			    if((regAddr1_tracker >= 0x7FFF ) || (record==0)){
			    	record=0;
			    	regAddr1_tracker=0x0;
			    	recorded[2]=1;

			    	i2c_rec_play=0;
			    }
			}

		}
		else if(track_select == 4){
	    	if(record == 1){
	    		play=0;
	//    		write_memory_I2C(eeprom_2_address, (uint16_t)regAddr2_tracker, (uint8_t *)&pwmvalue_save, 1);
	    		regAddr2_tracker++;

	    		if((regAddr2_tracker >= 0xFFFF ) || (record==0)){
	    			record=0;
	    			regAddr2_tracker=0x8000;
	    			recorded[3]=1;

	    			i2c_rec_play=0;
	    		}
	    	}

		}
	}
	else if(i2c_rec_play==2){

		if(track_select == 1){
	    	if(play == 1){
	    		record=0;
	    		random_read_I2C(eeprom_1_address, (uint16_t)regAddr1_tracker, (uint8_t *)&track[0], 1);
	    		delay(10000);
	    		pwmvalue_load=track[0];
	    		regAddr1_tracker++;

	    		if((regAddr1_tracker >= 0x7FFF ) || (play==0)){
	    			play=0;
	    			regAddr1_tracker=0x0;

	    			i2c_rec_play=0;
	    		}

	    	}
		}
		else if(track_select == 2){
	    	if(play == 1){
	    		record=0;
//	    		random_read_I2C(eeprom_1_address, (uint16_t)regAddr2_tracker, (uint8_t *)&track[0], 1);
	    		pwmvalue_load=track[0];
	    		regAddr2_tracker++;

	    		if((regAddr2_tracker >= 0xFFFF ) || (play==0)){
	    			play=0;
	    			regAddr2_tracker=0x0;

	    			i2c_rec_play=0;
	    		}
	    	}

		}
		else if(track_select == 3){
			if(play == 1){
				record=0;
//				random_read_I2C(eeprom_2_address, (uint16_t)regAddr1_tracker, (uint8_t *)&track[0], 1);
	    		pwmvalue_load=track[0];
				regAddr1_tracker++;

			    if((regAddr1_tracker >= 0x7FFF ) || (play==0)){
	    			play=0;
	    			regAddr1_tracker=0x0;

	    			i2c_rec_play=0;
			    }
			}

		}
		else if(track_select == 4){
	    	if(play == 1){
	    		record=0;
//	    		random_read_I2C(eeprom_2_address, (uint16_t)regAddr2_tracker, (uint8_t *)&track[0], 1);
	    		pwmvalue_load=track[0];
	    		regAddr2_tracker++;

	    		if((regAddr2_tracker >= 0xFFFF ) || (play==0)){
	    			play=0;
	    			regAddr2_tracker=0x0;

	    			i2c_rec_play=0;
	    		}
	    	}

		}
	}
	TIM16->SR	&= ~(1U <<0); 			//clear update status
}
void I2C1_IRQHandler(void){						//i2c handler
	//only come here if error occurs..
}
void ADC_COMP_IRQHandler(void){					//adc1 interrupt handler
	inputCaptureVal=(uint8_t)(ADC1->DR);		//capture mic value
	pwmvalue_save=(inputCaptureVal)%256;		//send captured value to save buffer
	ADC1->ISR &= (1U <<2); 						//clear interrupt
}
int main(void) {								//main
	//Enable clock for PORT A and PORT B
	RCC->IOPENR |= 0x3;
	RCC->IOPENR |= (1U << 2); //port c for test
	//**** Function inits ****//
	sysclock_64M();

	init_timer1();
	init_timer2();
	init_timer3();

	init_i2c();
	init_adc();

	lcd_init();
	init_keypad();
	//**** conf. PC6 as test led ****//
    GPIOC->MODER &= ~(3U << 2*6);
    GPIOC->MODER |= (1U << 2*6);

    GPIOB->MODER &= ~(3U << 2*4);
    GPIOB->MODER |= (1U << 2*4);

    delay(1000000);
    GPIOC->BRR |= (1U << 6);
    //**delete after test**//

    //**startup**//
    lcd_clear_all();						//clear lcd
    delay(100000);							//wait ~10ms
	lcd_setCursor(1,1);
	lcd_send_string("   Safa BULAT   ");
	lcd_setCursor(2,1);
	lcd_send_string("    141024051   ");
    delay(3000000);							//delay 1sec

    lcd_clear_all();
    idle=1;

    init_timer16();
    //**end startup**//
    while(1) {
		GPIOB->ODR ^= (1U << 4);
//		if(i2c_rec_play == 0){
//			voice_recorder();					//activate voice recorder
//		}
    }
    return 0;
}
//*************************Interrupts and main * END*************************//


//**********************PIN CONNECTIONs of the BOARD************************//

/*
 * Keypad;.....................................................................
 *  					(Don't forget the de-bounce buttons.)
 *
 *  Col1				PA7
 *  Col2				PA6
 *  Col3				PA11
 *  Col4				PA12
 *
 *  Row1				PA5
 *  Row2				PA4
 *  Row3				PA1
 *  Row4				PA0
 * ............................................................................
 *
 * I2C;........................................................................
 *
 * SCL: PB6
 * SDA: PB7
 *
 * On I2C bus i have 3 devices; EEPROM1, EEPROM2, 1602 LCD (i2c)
 * ............................................................................
 *
 * ADC; Mic. is connected to ADC at PB1........................................
 * ............................................................................
 *
 * PWM; PWM out is PB3 (connected to speaker)..................................
 * ............................................................................
 *
 * Test LED(s);................................................................
 * Onboard LED;			PC6
 * ............................................................................
 */
